---
type: RevisionsOnSheetUIServiceData
namespace: Autodesk.Revit.UI
version: 2024
members: 7
tags: [revit-api, class]
---

# RevisionsOnSheetUIServiceData

`Autodesk.Revit.UI.RevisionsOnSheetUIServiceData` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetParentHwnd | — | `public IntPtr GetParentHwnd ()` |
| Method | GetRevitElementIds | — | `public IList < ElementId > GetRevitElementIds ()` |
| Property | Document | — | `public Document Document { get ; }` |
| Property | IsReset | — | `public bool IsReset { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ParamId | — | `public ElementId ParamId { get ; }` |